
/**
 * 以下の結果を作ります
 * 
-----
|● ●|
| ● |
|● ●|
-----
出目は5です
    *コマンドプロンプト上にサイコロのようなものを表示してみましょう。
    * 以前乱数を使って1から6の数を出しましたが、今回は少し工夫してもう少しサイコロっぽくします。
 */
public class Pro20 {
    public static void main(String[] args) {
        String[][] sai = {
                {"-","-","-","-","-"},
                {"|"," "," "," ","|",},
                {"|"," "," "," ","|",},
                {"|"," "," "," ","|",},
                {"-","-","-","-","-"},
        };

        int r = (int)(Math.random()*6);

        if(r==0) {
            sai[2][2] = "●";
        }
        if(r==1) {
            sai[1][1] = "●";
            sai[3][3] = "●";
        }
        if(r==2) {
            sai[1][1] = "●";
            sai[2][2] = "●";
            sai[3][3] = "●";
        }
        if(r==3) {
            sai[1][1] = "●";
            sai[1][3] = "●";
            sai[3][1] = "●";
            sai[3][3] = "●";
        }
        if(r==4) {
            sai[1][1] = "●";
            sai[1][3] = "●";
            sai[2][2] = "●";
            sai[3][1] = "●";
            sai[3][3] = "●";
        }
        if(r==5) {
            sai[1][1] = "●";
            sai[2][1] = "●";
            sai[3][1] = "●";
            sai[1][3] = "●";
            sai[2][3] = "●";
            sai[3][3] = "●";
        }

        for(int i=0; i<sai.length; i++) {
            for(int j=0; j<sai[i].length; j++) {
                System.out.print(sai[i][j]);
            }
            System.out.println();
        }
        System.out.println("出目は"+(r+1)+"です");
    }
}
